{
  "Barbarian": {
    "reason": [
      "My devotion to my people lifted me in battle, making me powerful and dangerous.",
      "The spirits of my ancestors called on me to carry out a great task.",
      "I lost control in battle one day, and it was as if something else was manipulating my body, forcing it to kill every foe I could reach.",
      "I went on a spiritual journey to find myself and instead found a spirit animal to guide, protect, and inspire me.",
      "I was struck by lightning and lived. Afterward, I found a new strength within me that let me push beyond my limitations.",
      "My anger needed to be channeled into battle, or I risked becoming an indiscriminate killer."
    ],
    "quirk": [
      "If you disturb the bones of the dead, you inherit all the troubles that plagued them in life.",
      "Never trust a wizard. They're all devils in disguise, especially the friendly ones.",
      "Dwarves have lost their spirits, and are almost like the undead. That's why they live underground.",
      "Magical things bring trouble. Never sleep with a magic object within ten feet of you.",
      "When you walk through a graveyard, be sure to wear silver, or a ghost might jump into your body.",
      "If an elf looks you in the eyes, she's trying to read your thoughts."
    ]
  },
  "Bard": {
    "reason": [
      "I awakened my latent bardic abilities through trial and error.",
      "I was a gifted performer and attracted the attention of a master bard who schooled me in the old techniques.",
      "I joined a loose society of scholars and orators to learn new techniques of performance and magic.",
      "I felt a calling to recount the deeds of champions and heroes, to bring them alive in song and story.",
      "I joined one of the great colleges to learn old lore, the secrets of magic, and the art of performance.",
      "I picked up a musical instrument one day and instantly discovered that I could play it."
    ],
    "quirk": [
      "The time when your comedic song, 'Big Tom's Hijinks'—which, by the way, you thought was brilliant—did not go over well with Big Tom",
      "The matinee performance when a circus's owlbear got loose and terrorized the crowd",
      "When your opening song was your enthusiastic but universally hated rendition of 'Song of the Froghemoth'",
      "The first and last public performance of 'Mirt, Man about Town'",
      "The time on stage when your wig caught fire and you threw it down—which set fire to the stage",
      "When you sat on your lute by mistake during the final stanza of 'Starlight Serenade'"
    ]
  },
  "Cleric": {
    "reason": [
      "A supernatural being in service to the gods called me to become a divine agent in the world.",
      "I saw the injustice and horror in the world and felt moved to take a stand against them.",
      "My god gave me an unmistakable sign. I dropped everything to serve the divine.",
      "Although I was always devout, it wasn't until I completed a pilgrimage that I knew my true calling.",
      "I used to serve in my religion's bureaucracy but found I needed to work in the world, to bring the message of my faith to the darkest corners of the land.",
      "I realize that my god works through me, and I do as commanded, even though I don't know why I was chosen to serve."
    ],
    "quirk": [
      "An imp offers you counsel. You try to ignore the creature, but sometimes its advice is helpful.",
      "You believe that, in the final analysis, the gods are nothing more than ultrapowerful mortal creatures.",
      "You acknowledge the power of the gods, but you think that most events are dictated by pure chance.",
      "Even though you can work divine magic, you have never truly felt the presence of a divine essence within yourself.",
      "You are plagued by nightmares that you believe are sent by your god as punishment for some unknown transgression.",
      "In times of despair, you feel that you are but a plaything of the gods, and you resent their remoteness."
    ]
  },
  "Druid": {
    "reason": [
      "I saw too much devastation in the wild places, too much of nature's splendor ruined by the despoilers. I joined a circle of druids to fight back against the enemies of nature.",
      "I found a place among a group of druids after I fled a catastrophe.",
      "I have always had an affinity for animals, so I explored my talent to see how I could best use it.",
      "I befriended a druid and was moved by druidic teachings. I decided to follow my friend's guidance and give something back to the world.",
      "While I was growing up, I saw spirits all around me-entities no one else could perceive. I sought out the druids to help me understand the visions and communicate with these beings.",
      "I have always felt disgust for creatures of unnatural origin. For this reason, I immersed myself in the study of the druidic mysteries and became a champion of the natural order."
    ],
    "quirk": [
      "Your mentor was a wise treant who taught you to think in terms of years and decades rather than days or months.",
      "You were tutored by a dryad who watched over a slumbering portal to the Abyss. During your training, you were tasked with watching for hidden threats to the world.",
      "Your tutor always interacted with you in the form of a falcon. You never saw the tutor's humanoid form.",
      "You were one of several youngsters who were mentored by an old druid, until one of your fellow pupils betrayed your group and killed your master.",
      "Your mentor has appeared to you only in visions. You have yet to meet this person, and you are not sure such a person exists in mortal form.",
      "Your mentor was a werebear who taught you to treat all living things with equal regard."
    ]
  },
  "Fighter": {
    "reason": [
      "I wanted to hone my combat skills, and so I joined a war college.",
      "I squired for a knight who taught me how to fight, care for a steed, and conduct myself with honor. I decided to take up that path for myself.",
      "Horrible monsters descended on my community, killing someone I loved. I took up arms to destroy those creatures and others of a similar nature.",
      "I joined the army and learned how to fight as part of a group.",
      "I grew up fighting, and I refined my talents by defending myself against people who crossed me.",
      "I could always pick up just about any weapon and know how to use it effectively."
    ],
    "quirk": [
      "Elegant. You move with precise grace and total control, never using more energy than you need.",
      "Brutal. Your attacks rain down like hammer blows, meant to splinter bone or send blood flying.",
      "Cunning. You dart in to attack at just the right moment and use small-scale tactics to tilt the odds in your favor.",
      "Effortless. You rarely perspire or display anything other than a stoic expression in battle.",
      "Energetic. You sing and laugh during combat as your spirit soars. You are happiest when you have a foe in front of you and a weapon in hand.",
      "Sinister. You scowl and sneer while fighting, and you enjoy mocking your foes as you defeat them."
    ]
  },
  "Monk": {
    "reason": [
      "I was chosen to study at a secluded monastery. There, I was taught the fundamental techniques required to eventually master a tradition.",
      "I sought instruction to gain a deeper understanding of existence and my place in the world.",
      "I stumbled into a portal to the Shadowfell and took refuge in a strange monastery, where I learned how to defend myself against the forces of darkness.",
      "I was overwhelmed with grief after losing someone close to me, and I sought the advice of philosophers to help me cope with my loss.",
      "I could feel that a special sort of power lay within me, so I sought out those who could help me call it forth and master it.",
      "I was wild and undisciplined as a youngster, but then I realized the error of my ways. I applied to a monastery and became a monk as a way to live a life of discipline."
    ],
    "quirk": [
      "Monkey. Quick reflexes and the ability to travel through the treetops are two of the reasons why your order admires the monkey.",
      "Dragon Turtle. The monks of your seaside monastery venerate the dragon turtle, reciting ancient prayers and offering garlands of flowers to honor this living spirit of the sea.",
      "Ki-rin. Your monastery sees its main purpose as watching over and protecting the land in the manner of the ki-rin.",
      "Owlbear. The monks of your monastery revere a family of owlbears and have coexisted with them for generations.",
      "Hydra. Your order singles out the hydra for its ability to unleash several attacks simultaneously.",
      "Dragon. A dragon once laired within your monastery. Its influence remains long after its departure."
    ]
  },
  "Paladin": {
    "reason": [
      "A fantastical being appeared before me and called on me to undertake a holy quest.",
      "One of my ancestors left a holy quest unfulfilled, so I intend to finish that work.",
      "The world is a dark and terrible place. I decided to serve as a beacon of light shining out against the gathering shadows.",
      "I served as a paladin's squire, learning all I needed to swear my own sacred oath.",
      "Evil must be opposed on all fronts. I feel compelled to seek out wickedness and purge it from the world.",
      "Becoming a paladin was a natural consequence of my unwavering faith. In taking my vows, I became the holy sword of my religion."
    ],
    "quirk": [
      "Fury. When your anger is roused, you have trouble thinking straight, and you fear you might do something you'll regret.",
      "Pride. Your deeds are noteworthy, and no one takes note of them more often than you.",
      "Lust. You can't resist an attractive face and a pleasant smile.",
      "Envy. You are mindful of what some famous folk have accomplished, and you feel inadequate when your deeds don't compare to theirs.",
      "Despair. You consider the great strength of the enemies you must defeat, and at times you see no way to achieve final victory.",
      "Greed. Regardless of how much glory and treasure you amass, it's never enough for you."
    ]
  },
  "Ranger": {
    "reason": [
      "I found purpose while I honed my hunting skills by bringing down dangerous animals at the edge of civilization.",
      "I always had a way with animals, able to calm them with a soothing word and a touch.",
      "I suffer from terrible wanderlust, so being a ranger gave me a reason not to remain in one place for too long.",
      "I have seen what happens when the monsters come out from the dark. I took it upon myself to become the first line of defense against the evils that lie beyond civilization's borders.",
      "I met a grizzled ranger who taught me woodcraft and the secrets of the wild lands.",
      "I served in an army, learning the precepts of my profession while blazing trails and scouting enemy encampments."
    ],
    "quirk": [
      "You seek revenge on nature's behalf for the great transgressions your foe has committed.",
      "Your forebears or predecessors fought these creatures, and so shall you.",
      "You bear no enmity toward your foe. You stalk such creatures as a hunter tracks down a wild animal.",
      "You find your foe fascinating, and you collect books of tales and history concerning it.",
      "You collect tokens of your fallen enemies to remind you of each kill.",
      "You respect your chosen enemy, and you see your battles as a test of respective skills."
    ]
  },
  "Rogue": {
    "reason": [
      "I've always been nimble and quick of wit, so I decided to use those talents to help me make my way in the world.",
      "An assassin or a thief wronged me, so I focused my training on mastering the skills of my enemy to better combat foes of that sort.",
      "An experienced rogue saw something in me and taught me several useful tricks.",
      "I decided to turn my natural lucky streak into the basis of a career, though I still realize that improving my skills is essential.",
      "I took up with a group of ruffians who showed me how to get what I want through sneakiness rather than direct confrontation.",
      "I'm a sucker for a shiny bauble or a sack of coins, as long as I can get my hands on it without risking life and limb."
    ],
    "quirk": [
      "Your guilty pleasures is Large gems. Your benefactor is A smuggler kept you from getting caught but lost a valuable shipment in doing so. Now you owe that person an equally valuable favor.",
      "Your guilty pleasures is A smile from a pretty face. Your benefactor is The Beggar King has hidden you from your pursuers many times, in return for future considerations.",
      "Your guilty pleasures is A new ring for your finger. Your benefactor is A magistrate once kept you out of jail in return for information on a powerful crime lord.",
      "Your guilty pleasures is The chance to deflate someone's ego. Your benefactor is Your parents used their savings to bail you out of trouble in your younger days and are now destitute.",
      "Your guilty pleasures is The finest food and drink. Your benefactor is A dragon didn't eat you when it had a chance, and in return you promised to set aside choice pieces of treasure for it.",
      "Your guilty pleasures is Adding to your collection of exotic coins. Your benefactor is A druid once helped you out of a tight spot; now any random animal you see could be that benefactor, perhaps come to claim a return favor."
    ]
  },
  "Sorcerer": {
    "reason": [
      "When I was born, all the water in the house froze solid, the milk spoiled, or all the iron turned to copper. My family is convinced that this event was a harbinger of stranger things to come for me.",
      "I suffered a terrible emotional or physical strain, which brought forth my latent magical power. I have fought to control it ever since.",
      "My immediate family never spoke of my ancestors, and when I asked, they would change the subject. It wasn't until I started displaying strange talents that the full truth of my heritage came out.",
      "When a monster threatened one of my friends, I became filled with anxiety. I lashed out instinctively and blasted the wretched thing with a force that came from within me.",
      "Sensing something special in me, a stranger taught me how to control my gift.",
      "After I escaped from a magical conflagration, I realized that though I was unharmed, I was not unchanged. I began to exhibit unusual abilities that I am just beginning to understand."
    ],
    "quirk": [
      "You deliver the verbal components of your spells in the booming voice of a titan.",
      "For a moment after you cast a spell, the area around you grows dark and gloomy.",
      "You sweat profusely while casting a spell and for a few seconds thereafter.",
      "Your hair and garments are briefly buffeted about, as if by a breeze, whenever you call forth a spell.",
      "If you are standing when you cast a spell, you rise six inches into the air and gently float back down.",
      "Illusory blue flames wreathe your head as you begin your casting, then abruptly disappear."
    ]
  },
  "Warlock": {
    "reason": [
      "While wandering around in a forbidden place, I encountered an otherworldly being that offered to enter into a pact with me.",
      "I was examining a strange tome I found in an abandoned library when the entity that would become my patron suddenly appeared before me.",
      "I stumbled into the clutches of my patron after I accidentally stepped through a magical doorway.",
      "When I was faced with a terrible crisis, I prayed to any being who would listen, and the creature that answered became my patron.",
      "My future patron visited me in my dreams and offered great power in exchange for my service.",
      "One of my ancestors had a pact with my patron, so that entity was determined to bind me to the same agreement."
    ],
    "quirk": [
      "When directed, you must take immediate action against a specific enemy of your patron. One of your eyes looks the same as one of your patron's eyes.",
      "Your pact tests your willpower; you are required to abstain from alcohol and other intoxicants. Each time you wake up, the small blemish on your face appears in a different place.",
      "At least once a day, you must inscribe or carve your patron's name or symbol on the wall of a building. You display outward symptoms of a disease but suffer no ill effects from it.",
      "You must occasionally conduct bizarre rituals to maintain your pact. Your tongue is an unnatural color.",
      "You can never wear the same outfit twice, since your patron finds such predictability to be boring. You have a vestigial tail.",
      "When you use an eldritch invocation, you must speak your patron's name aloud or risk incurring its displeasure. Your face-element glows in the dark."
    ]
  },
  "Wizard": {
    "reason": [
      "An old wizard chose me from among several candidates to serve an apprenticeship.",
      "When I became lost in a forest, a hedge wizard found me, took me in, and taught me the rudiments of magic.",
      "I grew up listening to tales of great wizards and knew I wanted to follow their path. I strove to be accepted at an academy of magic and succeeded.",
      "One of my relatives was an accomplished wizard who decided I was smart enough to learn the craft.",
      "While exploring an old tomb, library, or temple, I found a spellbook. I was immediately driven to learn all I could about becoming a wizard.",
      "I was a prodigy who demonstrated mastery of the arcane arts at an early age. When I became old enough to set out on my own, I did so to learn more magic and expand my power."
    ],
    "quirk": [
      "You will prove that the gods aren't as powerful as folk believe. You have the habit of tapping your foot incessantly, which often annoys those around you.",
      "Immortality is the end goal of your studies. Your memory is quite good, but you have no trouble pretending to be absentminded when it suits your purposes.",
      "If you can fully understand magic, you can unlock its use for all and usher in an era of equality. You never enter a room without looking to see what's hanging from the ceiling.",
      "Magic is a dangerous tool. You use it to protect what you treasure. Your most prized possession is a dead worm that you keep inside a potion vial.",
      "Arcane power must be taken away from those who would abuse it. When you want people to leave you alone, you start talking to yourself. That usually does the trick.",
      "You will become the greatest wizard the world has seen in generations. Your fashion sense and grooming, or more accurately lack thereof, sometimes cause others to assume you are a beggar."
    ]
  }
}
