{
  "traits": [
    "I idolize a particular hero of my faith and constantly refer to that person's deeds and example.",
    "I can find common ground between the fiercest enemies, empathizing with them and always working toward peace.",
    "I see omens in every event and action. The gods try to speak to us, we just need to listen.",
    "Nothing can shake my optimistic attitude.",
    "I quote (or misquote) the sacred texts and proverbs in almost every situation.",
    "I am tolerant (or intolerant) of other faiths and respect (or condemn) the worship of other gods.",
    "I've enjoyed fine food, drink, and high society among my temple's elite. Rough living grates on me.",
    "I've spent so long in the temple that I have little practical experience dealing with people in the outside world.",
    "I fall in and out of love easily, and am always pursuing someone.",
    "I have a joke for every occasion, especially occasions where humor is inappropriate.",
    "Flattery is my preferred trick for getting what I want.",
    "I'm a born gambler who can't resist taking a risk for a potential payoff.",
    "I lie about almost everything, even when there's no good reason to.",
    "Sarcasm and insults are my weapons of choice.",
    "I keep multiple holy symbols on me and invoke whatever deity might come in useful at any given moment.",
    "I pocket anything I see that might have some value.",
    "I always have plan for what to do when things go wrong.",
    "I am always calm, no matter what the situation. I never raise my voice or let my emotions control me.",
    "The first thing I do in a new place is note the locations of everything valuable--or where such things could be hidden.",
    "I would rather make a new friend than a new enemy.",
    "I am incredibly slow to trust. Those who seem the fairest often have the most to hide.",
    "I don't pay attention to the risks in a situation. Never tell me the odds.",
    "The best way to get me to do something is to tell me I can't do it.",
    "I blow up at the slightest insult.",
    "I know a story relevant to almost every situation.",
    "Whenever I come to a new place, I collect local rumors and spread gossip.",
    "I'm a hopeless romantic, always searching for that 'special someone'.",
    "Nobody stays angry at me or around me for long, since I can defuse any amount of tension.",
    "I love a good insult, even one directed at me.",
    "I get bitter if I'm not the center of attention.",
    "I'll settle for nothing less than perfection.",
    "I change my mood or my mind as quickly as I change key in a song.",
    "I judge people by their actions, not their words.",
    "If someone is in trouble, I'm always willing to lend help.",
    "When I set my mind to something, I follow through no matter what gets in my way.",
    "I have a strong sense of fair play and always try to find the most equitable solution to arguments.",
    "I'm confident in my own abilities and do what I can to instill confidence in others.",
    "Thinking is for other people. I prefer action.",
    "I misuse long words in an attempt to sound smarter.",
    "I get bored easily. When am I going to get on with my destiny.",
    "I believe that everything worth doing is worth doing right. I can't help it--I'm a perfectionist.",
    "I'm a snob who looks down on those who can't appreciate fine art.",
    "I always want to know how things work and what makes people tick.",
    "I'm full of witty aphorisms and have a proverb for every occasion.",
    "I'm rude to people who lack my commitment to hard work and fair play.",
    "I like to talk at length about my profession.",
    "I don't part with my money easily and will haggle tirelessly to get the best deal possible.",
    "I'm well known for my work, and I want to make sure everyone appreciates it. I'm always taken aback when people haven't heard of me.",
    "I've been isolated for so long that I rarely speak, preferring gestures and the occasional grunt.",
    "I am utterly serene, even in the face of disaster.",
    "The leader of my community has something wise to say on every topic, and I am eager to share that wisdom.",
    "I feel tremendous empathy for all who suffer.",
    "I'm oblivious to etiquette and social expectations.",
    "I connect everything that happens to me to a grand cosmic plan.",
    "I often get lost in my own thoughts and contemplations, becoming oblivious to my surroundings.",
    "I am working on a grand philosophical theory and love sharing my ideas.",
    "My eloquent flattery makes everyone I talk to feel like the most wonderful and important person in the world.",
    "The common folk love me for my kindness and generosity.",
    "No one could doubt by looking at my regal bearing that I am a cut above the unwashed masses.",
    "I take great pains to always look my best and follow the latest fashions.",
    "I don't like to get my hands dirty, and I won't be caught dead in unsuitable accommodations.",
    "Despite my birth, I do not place myself above other folk. We all have the same blood.",
    "My favor, once lost, is lost forever.",
    "If you do me an injury, I will crush you, ruin your name, and salt your fields.",
    "I'm driven by a wanderlust that led me away from home.",
    "I watch over my friends as if they were a litter of newborn pups.",
    "I once ran twenty-five miles without stopping to warn my clan of an approaching orc horde. I'd do it again if I had to.",
    "I have a lesson for every situation, drawn from observing nature.",
    "I place no stock in wealthy or well-mannered folk. Money and manners won't save you from a hungry owlbear.",
    "I'm always picking things up, absently fiddling with them, and sometimes accidentally breaking them.",
    "I feel far more comfortable around animals than people.",
    "I was, in fact, raised by wolves.",
    "I use polysyllabic words to convey the impression of great erudition.",
    "I've read every book in the world's greatest libraries--or like to boast that I have.",
    "I'm used to helping out those who aren't as smart as I am, and I patiently explain anything and everything to others.",
    "There's nothing I like more than a good mystery.",
    "I'm willing to listen to every side of an argument before I make my own judgment.",
    "I...speak...slowly...when talking...to idiots...which...almost...everyone...is...compared...to me.",
    "I am horribly, horribly awkward in social situations.",
    "I'm convinced that people are always trying to steal my secrets.",
    "My friends know they can rely on me, no matter what.",
    "I work hard so that I can play hard when the work is done.",
    "I enjoy sailing into new ports and making new friends over a flagon of ale.",
    "I stretch the truth for the sake of a good story.",
    "To me, a tavern brawl is a nice way to get to know a new city.",
    "I never pass up a friendly wager.",
    "My language is as foul as an otyugh nest.",
    "I like a job well done, especially if I can convince someone else to do it.",
    "I'm always polite and respectful.",
    "I'm haunted by memories of war. I can't get the images of violence out of my mind.",
    "I've lost too many friends, and I'm slow to make new ones.",
    "I'm full of inspiring and cautionary tales from my military experience relevant to almost every combat situation.",
    "I can stare down a hellhound without flinching.",
    "I enjoy being strong and like breaking things.",
    "I have a crude sense of humor.",
    "I face problems head-on. A simple direct solution is the best path to success.",
    "I hide scraps of food and trinkets away in my pockets.",
    "I ask a lot of questions.",
    "I like to squeeze into small places where no one else can get to me.",
    "I sleep with my back to a wall or tree, with everything I own wrapped in a bundle in my arms.",
    "I eat like a pig and have bad manners.",
    "I think anyone who's nice to me is hiding evil intent.",
    "I don't like to bathe.",
    "I bluntly say what other people are hinting or hiding."
  ],
  "ideals": [
    "Faith. I trust that my deity will guide my actions. I have faith that if I work hard, things will go well.",
    "Tradition. The ancient traditions of worship and sacrifice must be preserved and upheld.",
    "Charity. I always try to help those in need, no matter what the personal cost.",
    "Change. We must help bring about the changes the gods are constantly working in the world.",
    "Power. I hope to one day rise to the top of my faith's religious hierarchy.",
    "Aspiration. I seek to prove my self worthy of my god's favor by matching my actions against his or her teachings.",
    "Independence. I am a free spirit--no one tells me what to do.",
    "Fairness. I never target people who can't afford to lose a few coins.",
    "Charity. I distribute money I acquire to the people who really need it.",
    "Creativity. I never run the same con twice.",
    "Friendship. Material goods come and go. Bonds of friendship last forever.",
    "Aspiration. I'm determined to make something of myself.",
    "Honor. I don't steal from others in the trade.",
    "Freedom. Chains are meant to be broken, as are those who would forge them.",
    "Charity. I steal from the wealthy so that I can help people in need.",
    "Greed. I will do whatever it takes to become wealthy.",
    "People. I'm loyal to my friends, not to any ideals, and everyone else can take a trip down the Styx for all I care.",
    "Redemption. There's a spark of good in everyone.",
    "Beauty. When I perform, I make the world better than it was.",
    "Tradition. The stories, legends, and songs of the past must never be forgotten.",
    "Creativity. The world is in need of new ideas and bold action.",
    "Greed. I'm only in it for the money and fame.",
    "People. I like seeing the smiles on people's faces when I perform. That's all that matters.",
    "Honesty. Art should reflect the soul; it should come from within and reveal who we really are.",
    "Respect. People deserve to be treated with dignity and respect.",
    "Fairness. No one should get preferential treatment before the law, and no one is above the law.",
    "Freedom. Tyrants must not be allowed to oppress the people.",
    "Might. If I become strong, I can take what I want--what I deserve.",
    "Sincerity. There's no good pretending to be something I'm not.",
    "Destiny. Nothing and no one can steer me away from my higher calling.",
    "Community. It is the duty of all civilized people to strengthen the bonds of community and the security of civilization.",
    "Generosity. My talents were given to me so that I could use them to benefit the world.",
    "Freedom. Everyone should be free to pursue his or her livelihood.",
    "Greed. I'm only in it for the money.",
    "People. I'm committed to the people I care about, not to ideals.",
    "Aspiration. I work hard to be the best there is at my craft.",
    "Greater Good. My gifts are meant to be shared with all, not used for my own benefit.",
    "Logic. Emotions must not cloud our sense of what is right and true, or our logical thinking.",
    "Free Thinking. Inquiry and curiosity are the pillars of progress.",
    "Power. Solitude and contemplation are paths toward mystical or magical power.",
    "Live and Let Live. Meddling in the affairs of others only causes trouble.",
    "Self-Knowledge. If you know yourself, there're nothing left to know.",
    "Respect. Respect is due to me because of my position, but all people regardless of station deserve to be treated with dignity.",
    "Responsibility. It is my duty to respect the authority of those above me, just as those below me must respect mine.",
    "Independence. I must prove that I can handle myself without the coddling of my family.",
    "Power. If I can attain more power, no one will tell me what to do.",
    "Family. Blood runs thicker than water.",
    "Noble Obligation. It is my duty to protect and care for the people beneath me.",
    "Change. Life is like the seasons, in constant change, and we must change with it.",
    "Greater Good. It is each person's responsibility to make the most happiness for the whole tribe.",
    "Honor. If I dishonor myself, I dishonor my whole clan.",
    "Might. The strongest are meant to rule.",
    "Nature. The natural world is more important than all the constructs of civilization.",
    "Glory. I must earn glory in battle, for myself and my clan.",
    "Knowledge. The path to power and self-improvement is through knowledge.",
    "Beauty. What is beautiful points us beyond itself toward what is true.",
    "Logic. Emotions must not cloud our logical thinking.",
    "No Limits. Nothing should fetter the infinite possibility inherent in all existence.",
    "Power. Knowledge is the path to power and domination.",
    "Self-improvement. The goal of a life of study is the betterment of oneself.",
    "Respect. The thing that keeps a ship together is mutual respect between captain and crew.",
    "Fairness. We all do the work, so we all share in the rewards.",
    "Freedom. The sea is freedom--the freedom to go anywhere and do anything.",
    "Master. I'm a predator, and the other ships on the sea are my prey.",
    "People. I'm committed to my crewmates, not to ideals.",
    "Aspiration. Someday I'll own my own ship and chart my own destiny.",
    "Greater Good. Our lot is to lay down our lives in defense of others.",
    "Responsibility. I do what I must and obey just authority.",
    "Independence. When people follow orders blindly they embrace a kind of tyranny.",
    "Might. In life as in war, the stronger force wins.",
    "Ideals aren't worth killing for or going to war for. ",
    "Nation. My city, nation, or people are all that matter.",
    "Respect. All people, rich or poor, deserve respect.",
    "Community. We have to take care of each other, because no one else is going to do it.",
    "Change. The low are lifted up, and the high and mighty are brought down. Change is the nature of things.",
    "Retribution. The rich need to be shown what life and death are like in the gutters.",
    "People. I help people who help me--that's what keeps us alive.",
    "Aspiration. I'm going to prove that I'm worthy of a better life."
  ],
  "bonds": [],
  "flaws": []
}
